In [64]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df = pd.read_csv("salary_data.csv")
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,NaN
...,...,...,...,...,...,...
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [66]:
df.isna().sum()

Age                    3
Gender                 2
Education Level        2
Job Title              2
Years of Experience    4
Salary                 5
dtype: int64

In [67]:
df["Age"].isnull().sum()

np.int64(3)

In [68]:
df["Age"].median()

36.0

In [69]:
df["Age"] = df["Age"].fillna(df["Age"].median())

In [70]:
df["Age"].isnull().sum()

np.int64(0)

In [71]:
df["Years of Experience"].isnull().sum()

np.int64(4)

In [72]:
df["Years of Experience"].mean()

np.float64(10.05256064690027)

In [73]:
df["Years of Experience"] = df["Years of Experience"].fillna(df["Years of Experience"].mean())

In [74]:
df["Years of Experience"].isnull().sum()

np.int64(0)

In [75]:
df["Salary"].isnull().sum()

np.int64(5)

In [76]:
df = df.dropna(subset=["Salary"])

In [77]:
df.isna().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [ ]:
df.to_csv("salary_data_cleaned.csv", index=False)

In [79]:
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0

In [80]:
df.tail()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [81]:
df.head(20)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.000000,90000.0
1,28.0,Female,Master's,Data Analyst,3.000000,65000.0
2,45.0,Male,PhD,Senior Manager,15.000000,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.000000,60000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.000000,55000.0
6,36.0,Female,Master's,Product Manager,12.000000,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.000000,80000.0
8,26.0,Female,Bachelor's,Marketing Coordinator,1.000000,45000.0
9,38.0,Male,PhD,Senior Scientist,10.000000,110000.0
10,29.0,Male,Master's,Software Developer,3.000000,75000.0
11,48.0,Female,Bachelor's,HR Manager,18.000000,140000.0
12,35.0,Male,Bachelor's,Financial Analyst,6.000000,65000.0
14,27.0,Male,Bachelor's,Customer Service Rep,2.000000,40000.0
16,33.0,Female,Master's,Marketing Manager,7.000000,90000.0
17,39.0,Male,PhD,Senior Engineer,10.052561,115000.0
18,25.0,Female,Bachelor's,Data Entry Clerk,10.052561,35000.0
19,51.0,Male,Bachelor's,Sales Director,22.000000,180000.0
20,34.0,Female,Master's,Business Analyst,5.000000,80000.0
21,47.0,Male,Master's,VP of Operations,19.000000,190000.0
22,30.0,Male,Bachelor's,IT Support,2.000000,50000.0

In [82]:
df.tail(20)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
355,40.0,Male,Bachelor's,Senior Financial Analyst,12.0,130000.0
356,45.0,Female,PhD,Senior UX Designer,16.0,160000.0
357,33.0,Male,Bachelor's,Junior Product Manager,4.0,60000.0
358,36.0,Female,Bachelor's,Senior Marketing Manager,8.0,95000.0
359,47.0,Male,Master's,Director of Operations,19.0,170000.0
360,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
361,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
362,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0
363,33.0,Male,Bachelor's,Junior Marketing Specialist,5.0,70000.0
364,35.0,Female,Bachelor's,Senior Financial Manager,8.0,90000.0
365,43.0,Male,Master's,Director of Marketing,18.0,170000.0
366,31.0,Female,Bachelor's,Junior Financial Analyst,3.0,50000.0
367,41.0,Male,Bachelor's,Senior Product Manager,14.0,150000.0
368,44.0,Female,PhD,Senior Data Engineer,16.0,160000.0
369,33.0,Male,Bachelor's,Junior Business Analyst,4.0,60000.0
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [83]:
df.shape

(370, 6)

In [84]:
df.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [85]:
df.dtypes

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 370 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  370 non-null    float64
 1   Gender               370 non-null    object
 2   Education Level      370 non-null    object
 3   Job Title            370 non-null    object
 4   Years of Experience  370 non-null    float64
 5   Salary               370 non-null    float64
dtypes: float64(3), object(3)
memory usage: 20.2+ KB

In [87]:
df.describe()

              Age  Years of Experience         Salary
count  370.000000           370.000000     370.000000
mean    37.351351             9.998933  100163.108108
std      7.043482             6.530781   48115.440420
min     23.000000             0.000000     350.000000
25%     31.000000             4.000000   55000.000000
50%     36.000000             9.000000   95000.000000
75%     44.000000            15.000000  140000.000000
max     53.000000            25.000000  250000.000000

In [88]:
df["Salary"].mean()

np.float64(100163.1081081081)

In [89]:
df["Salary"].min()

350.0

In [90]:
df["Salary"].max()

250000.0

In [91]:
df["Job Title"].value_counts()

Job Title
Director of Marketing             12
Director of Operations            11
Senior Business Analyst           10
Senior Marketing Analyst           9
Senior Marketing Manager           9
                                  ..
Junior Social Media Specialist     1
Junior Operations Coordinator      1
Senior HR Specialist               1
Director of HR                     1
Junior Financial Advisor           1
Name: count, Length: 173, dtype: int64

In [92]:
df.iloc[:10]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
5,29.0,Male,Bachelor's,Marketing Analyst,2.0,55000.0
6,36.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
8,26.0,Female,Bachelor's,Marketing Coordinator,1.0,45000.0
9,38.0,Male,PhD,Senior Scientist,10.0,110000.0
10,29.0,Male,Master's,Software Developer,3.0,75000.0

In [93]:
df[["Age","Salary"]]

      Age    Salary
0    32.0   90000.0
1    28.0   65000.0
2    45.0  150000.0
3    36.0   60000.0
5    29.0   55000.0
..    ...       ...
370  35.0   85000.0
371  43.0  170000.0
372  29.0   40000.0
373  34.0   90000.0
374  44.0  150000.0

[370 rows x 2 columns]

In [94]:
df[df["Age"] > 30]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
6,36.0,Female,Master's,Product Manager,12.0,120000.0
7,31.0,Male,Bachelor's,Sales Manager,4.0,80000.0
...,...,...,...,...,...,...
369,33.0,Male,Bachelor's,Junior Business Analyst,4.0,60000.0
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [95]:
df[df["Salary"] > 100000]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
2,45.0,Male,PhD,Senior Manager,15.000000,150000.0
6,36.0,Female,Master's,Product Manager,12.000000,120000.0
9,38.0,Male,PhD,Senior Scientist,10.000000,110000.0
11,48.0,Female,Bachelor's,HR Manager,18.000000,140000.0
17,39.0,Male,PhD,Senior Engineer,10.052561,115000.0
...,...,...,...,...,...,...
365,43.0,Male,Master's,Director of Marketing,18.000000,170000.0
367,41.0,Male,Bachelor's,Senior Product Manager,14.000000,150000.0
368,44.0,Female,PhD,Senior Data Engineer,16.000000,160000.0
371,43.0,Male,Master's,Director of Operations,19.000000,170000.0
374,44.0,Female,PhD,Senior Business Analyst,15.000000,150000.0

In [96]:
df[df["Age"] > 30][["Age", "Salary"]]

      Age    Salary
0    32.0   90000.0
2    45.0  150000.0
3    36.0   60000.0
6    36.0  120000.0
7    31.0   80000.0
..    ...       ...
369  33.0   60000.0
370  35.0   85000.0
371  43.0  170000.0
373  34.0   90000.0
374  44.0  150000.0

[297 rows x 2 columns]

In [97]:
condition = (df["Age"] > 30) & (df["Salary"] > 100000)
df[condition]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
2,45.0,Male,PhD,Senior Manager,15.000000,150000.0
6,36.0,Female,Master's,Product Manager,12.000000,120000.0
9,38.0,Male,PhD,Senior Scientist,10.000000,110000.0
11,48.0,Female,Bachelor's,HR Manager,18.000000,140000.0
17,39.0,Male,PhD,Senior Engineer,10.052561,115000.0
...,...,...,...,...,...,...
365,43.0,Male,Master's,Director of Marketing,18.000000,170000.0
367,41.0,Male,Bachelor's,Senior Product Manager,14.000000,150000.0
368,44.0,Female,PhD,Senior Data Engineer,16.000000,160000.0
371,43.0,Male,Master's,Director of Operations,19.000000,170000.0
374,44.0,Female,PhD,Senior Business Analyst,15.000000,150000.0

In [98]:
df.sort_values(by="Salary")

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
259,29.0,Male,Bachelor's,Junior Business Operations Analyst,1.5,350.0
82,25.0,Male,Bachelor's,Sales Representative,0.0,30000.0
310,29.0,Female,Bachelor's,Junior Business Development Associate,1.5,35000.0
49,25.0,Male,Bachelor's,Help Desk Analyst,0.0,35000.0
283,29.0,Female,Bachelor's,Junior Business Development Associate,1.5,35000.0
...,...,...,...,...,...,...
21,47.0,Male,Master's,VP of Operations,19.0,190000.0
53,47.0,Male,Master's,VP of Finance,19.0,200000.0
105,44.0,Male,PhD,Chief Data Officer,16.0,220000.0
30,50.0,Male,Bachelor's,CEO,25.0,250000.0
83,52.0,Male,PhD,Chief Technology Officer,24.0,250000.0

In [99]:
df.sort_values(by="Years of Experience", ascending=False)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
93,52.0,Female,Master's,Senior Marketing Manager,25.0,170000.0
121,53.0,Male,Master's,Director of Marketing,25.0,180000.0
30,50.0,Male,Bachelor's,CEO,25.0,250000.0
83,52.0,Male,PhD,Chief Technology Officer,24.0,250000.0
60,51.0,Female,Master's,Director of Operations,23.0,170000.0
...,...,...,...,...,...,...
97,26.0,Male,Bachelor's,Junior Software Developer,1.0,35000.0
64,26.0,Male,Bachelor's,Junior Accountant,1.0,35000.0
114,23.0,Female,Bachelor's,Junior Marketing Analyst,0.5,35000.0
82,25.0,Male,Bachelor's,Sales Representative,0.0,30000.0
49,25.0,Male,Bachelor's,Help Desk Analyst,0.0,35000.0

In [100]:
grouped = df.groupby("Job Title")

In [101]:
grouped["Salary"].mean()

Job Title
Account Manager                  75000.0
Accountant                       55000.0
Administrative Assistant         50000.0
Business Analyst                 77500.0
Business Development Manager     90000.0
                                  ...
UX Designer                      80000.0
UX Researcher                    65000.0
VP of Finance                   200000.0
VP of Operations                190000.0
Web Developer                    65000.0
Name: Salary, Length: 173, dtype: float64

In [102]:
df["Exp_Age_Ratio"] = df["Years of Experience"] / df["Age"]

/tmp/ipykernel_36489/2736614377.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Exp_Age_Ratio"] = df["Years of Experience"] / df["Age"]

In [104]:
df["Exp_Age_Ratio"]

0      0.156250
1      0.107143
2      0.333333
3      0.194444
5      0.068966
         ...
370    0.228571
371    0.441860
372    0.068966
373    0.205882
374    0.340909
Name: Exp_Age_Ratio, Length: 370, dtype: float64

In [105]:
df.columns = df.columns.str.upper()

In [106]:
df.columns

Index(['AGE', 'GENDER', 'EDUCATION LEVEL', 'JOB TITLE', 'YEARS OF EXPERIENCE',
       'SALARY', 'EXP_AGE_RATIO'],
      dtype='object')

In [107]:
numeric_length = df.select_dtypes(include=np.number).map(
    lambda x: len(str(x))
)
numeric_length

     AGE  YEARS OF EXPERIENCE  SALARY  EXP_AGE_RATIO
0      4                    3       7              7
1      4                    3       7             19
2      4                    4       8             18
3      4                    3       7             19
5      4                    3       7             19
..   ...                  ...     ...            ...
370    4                    3       7             19
371    4                    4       8             18
372    4                    3       7             19
373    4                    3       7             19
374    4                    4       8             18

[370 rows x 4 columns]

In [109]:
df = df.round(4)